`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2022/12/04 10:45:42
// Design Name: 
// Module Name: InstrMem
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


module InstrMem(
    input [31:0] addr,
    output [31:0] instr
);

    reg [31:0] mem [1023:0];
    
    initial begin
        mem[0]=32'b100011_00000_00100_00000000_00000011; //lw
        mem[1]=32'b100011_00000_00001_00000000_00000001; //lw
        mem[2]=32'b100011_00000_00010_00000000_00000010; //lw
        mem[3]=32'b100011_00000_00011_00000000_00000100; //lw
        mem[4]=32'b000100_00010_00011_00000000_00000010; //beq
        mem[5]=32'b000000_00010_00001_00010_00000_100000; //add
        mem[6]=32'b000010_00_0001_0000_0000_0000_0000_0100; //j
        mem[7]=32'b101011_00000_00010_00000000_00000011; //sw
        mem[8]=32'b000010_00_0001_0000_0000_0000_0000_0000; //j
    end

    assign instr = mem[((addr - 32'h00400000) >> 2)];	//转换输入地址为寄存器序号

endmodule
